
CompanySizeFields = ( 
    ("1", "صغيرة"), 
    ("2", "متوسطة"),
    ("3", "كبيرة"),
    ("4", "عملاقة"),
)

CompanySectionFields = ( 
    ("1", "حكومي"), 
    ("2", "خاص"),
    ("3", "غير ربحي"),
)

CompanyHaveCertFields = ( 
    ("0", "لا"), 
    ("1", "نعم"),
    ("2", "جاري العمل عليها"),
)

CompanyGenderFields = ( 
    ("1", "ذكر"), 
    ("2", "انثى"),
    ("3", "الجنسين"),
)

CompanyWorktimeFields = ( 
    ("1", "فترة صباحية"), 
    ("2", "فترة مسائية"),
)

PostStateFields = ( 
    ("1", "في قائمة الانتظار"), 
    ("2", "جاري التدقيق"),
    ("3", "قبول"),
    ("4", "رفض"),
    ("5", "مكتمل"),
)


CertTypeFieldsCompany = ( 
    ("1", "المرحلة الثانوية"), 
    ("2", "دبلوم"),
    ("3", "البكالوريوس"),
    ("4", "ماجستير"),
    ("5", "دكتوراة"),
    ("0", "لا يهم"),
)
