StateFields = ( 
    ("0", "اعزب"), 
    ("1", "متزوج"),  
)

YesNoFields = (
    ("0", "لا"),
    ("1", "نعم"),   
)

NationalityFields = ( 
    ("1", "سعودي"), 
    ("2", "غير سعودي"),  
)

GenderFields = ( 
    ("1", "ذكر"), 
    ("2", "انثى"),  
)

HowHearFields = ( 
    ("1", "صديق"), 
    ("2", "الجمعيات الداعمة للأشخاص ذوي الإعاقة"),
    ("3", "منصات التواصل الإجتماعي"),
    ("0", "اخرى"),
)

DisabilityTypeFields = ( 
    ("1", "إعاقة حركية"), 
    ("2", "إعاقة عقلية"),
    ("3", "إضطرابات إنفعالية"),
    ("4", "إعاقات سمعية"), 
    ("5", "إعاقات بصرية"),
    ("6", "إعاقة متلازمة الداون"),
    ("7", "الإعاقات الجسمية"), 
    ("8", "التوحد"),
    ("9", "صعوبات التعلم"),
    ("10", "الإضطرابات السلوكية"), 
    ("11", "صعوبات النطق والكلام"),

    ("12", "أنيميا منجلية"), 
    ("13", "سيولة في الدم"),
    ("14", "تصلب لويحي"),
    ("15", "أمراض القلب"),
    ("16", "فشل كلوي"),
    ("0", "اخرى"),
)


DisabilityMovementFields = ( 
    ("1", "كرسي متحرك"), 
    ("2", "عكاز"),
    ("3", "عرج"),
    ("4", "عمود فقري"), 
    ("5", "بتر"),
)

DisabilityAmputationTypeFields = ( 
    ("1", "بتر كامل"), 
    ("2", "بتر جزئي"),
)


DisabilityMindFields = ( 
    ("1", "خفيفة"), 
    ("2", "متوسطة"),
    ("3", "شديدة"),
)

DisabilityHearFields = ( 
    ("1", "بكم  مع فقدان السمع"), 
    ("2", "ضعف سمع"),
)

DisabilityEaysFields = ( 
    ("1", "كف إبصار كامل"), 
    ("2", "كف إبصار جزئي"),
)

DisabilityAloneFields = ( 
    ("1", "خفيفة"), 
    ("2", "متوسطة"),
    ("3", "شديدة"),
)

DisabilityOthersFields = ( 
    ("1", "أنيميا منجلية"), 
    ("2", "سيولة في الدم"),
    ("3", "تصلب لويحي"),
    ("4", "أمراض القلب"),
    ("5", "فشل كلوي"),
    ("0", "اخرى"),
)

CertTypeFields = ( 
    ("1", "المرحلة الثانوية"), 
    ("2", "دبلوم"),
    ("3", "البكالوريوس"),
    ("4", "ماجستير"),
    ("5", "دكتوراة"),
)

JobTypeFields = ( 
    ("1", "دوام جزئي"), 
    ("2", "دوام كامل"),
    ("3", "عن بعد"),
)

JobPropertiesFields = ( 
    ("1", "العمل في بيئة هادئة"), 
    ("2", "العمل يتطلب الحركة والتنقل"),
    ("3", "العمل في بيئة باردة"),
    ("4", "مكتبي/العمل في مكان واحد"),
    ("5", "العمل في بيئة غير مختلطة"),
    ("0", "لا يهم"),
)

LanguageLevelFields = ( 
    ("0", "لا أجيد"), 
    ("1", "ضعيف"),
    ("2", "متوسط"),
    ("3", "قوي"),
)

# LearningDomainFields = ( 
#     ("1", "إقتصاد وإدارة"), 
#     ("2", "طب"),
#     ("3", "هندسة"),
#     ("4", "فنون"), 
#     ("5", "الإتصال والإعلام"),
#     ("6", "حاسب"),
#     ("7", "الآداب"), 
#     ("8", "كيمياء"),
#     ("9", "فيزياء"),
#     ("0", "اخرى"),
# )



LearningDomainFields = ( 
    ("1", "كلية الاقتصاد والإدارة"),
    ("2", "معهد الاقتصاد الإسلامي"),
    ("3", "كلية الآداب والعلوم الإنسانية"),
    ("4", "معهد اللغة الإنجليزية"),
    ("5", "كلية العلوم"),
    ("6", "كلية الهندسة"),
    ("7", "كلية العمارة والتخطيط"),
    ("8", "كلية الطب"),
    ("9", "كلية العلوم التطبيقية"),
    ("10", "كلية علوم الأرض"),
    ("11", "كلية علوم البحار"),
    ("12", "كلية الحقوق"),
    ("13", "كلية العلوم البيئية"),
    ("16", "كلية الصيدلة"),
    ("18", "كلية السياحة"),
    ("19", "كلية علوم الانسان والتصاميم"),
    ("21", "كلية التربية"),
    ("22", "كلية الاتصال والإعلام"),
    ("24", "كلية الحاسبات وتقنية المعلومات"),
    ("25", "كلية التمريض"),
    ("0", "أخرى"),

)


citys = (
    ("1", "ابها"),
    ("2", "ابو عريش"),
    ("3", "احد المسارحة"),
    ("4", "الأفلاج"),
    ("5", "الاحساء"),
    ("6", "الارطاوية"),
    ("7", "الباحة"),
    ("8", "البكيرية"),
    ("9", "الثقبة"),
    ("10", "الجبيل"),
    ("11", "الخبر"),
    ("12", "الخرج"),
    ("13", "الخفجي"),
    ("14", "الدلم"),
    ("15", "الدمام"),
    ("16", "الدوادمي"),
    ("17", "الرس"),
    ("18", "الرقعي"),
    ("19", "الرياض"),
    ("20", "الزلفي"),
    ("21", "السليل"),
    ("22", "الطائف"),
    ("23", "العلا"),
    ("24", "الغاط"),
    ("25", "القريات"),
    ("26", "القطيف"),
    ("27", "القويعية"),
    ("28", "المجمعه"),
    ("29", "المدينة المنورة"),
    ("30", "المذنب"),
    ("31", "المزاحمية"),
    ("32", "النعيرية"),
    ("33", "النماص"),
    ("34", "الهفوف"),
    ("35", "املج"),
    ("36", "بدر"),
    ("37", "بريدة"),
    ("38", "بقيق"),
    ("39", "بلجرشي"),
    ("40", "بيشة"),
    ("41", "تبوك"),
    ("42", "جازان"),
    ("43", "جدة"),
    ("44", "حائل"),
    ("45", "حفر الباطن"),
    ("46", "حقل"),
    ("47", "حوطة سدير"),
    ("48", "خميس مشيط"),
    ("49", "خيبر"),
    ("50", "دومة الجندل"),
    ("51", "رابغ"),
    ("52", "رياض الخبراء"),
    ("53", "سبت العلايا"),
    ("54", "سكاكا"),
    ("55", "شرورة"),
    ("56", "شقراء"),
    ("57", "صبيا"),
    ("58", "ضباء"),
    ("59", "ضرما"),
    ("60", "طريف"),
    ("61", "عرعر"),
    ("62", "عنيزة"),
    ("63", "قرية العليا"),
    ("64", "محايل عسير"),
    ("65", "مكة المكرمة"),
    ("66", "نجران"),
    ("67", "وادي الدواسر"),
    ("68", "ينبع"),
)

EmployeePostStateFields = ( 
    ("1", "في قائمة الانتظار"), 
    ("2", "جاري التدقيق"),
    ("3", "قبول"),
    ("4", "رفض"),
    ("5", "مستبعد"),
)

EmployeeJobStateFields = ( 
    ("1", "في قائمة الانتظار"), 
    ("2", "جاري التدقيق"),
    ("3", "قبول"),
    ("5", "مستبعد"),
    ("6", "مسودة"),
)

